def solution(quiz):
    quiz_split = []
    for c in quiz:
        quiz_split.append(str(c).split(" "))
    answer = []
    return quiz_split


#["3 - 4 = -3", "5 + 6 = 11"] 
#["19 - 6 = 13", "5 + 66 = 71", "5 - 15 = 63", "3 - 1 = 2"]
#각 인덱스마다 길이도 다르고 연산자도 다른데 어떻게 분리하지? 라는 고민
#쪼갤 수 있는 구조인지 먼저 확인 split(" ") gpt 통해서 힌트 얻음

#quiz_split = str(quiz).split(" ")
#["['3","-","4","=","-3',","'5","+","6","=","11']"]
#["['19","-","6","=","13',","'5","+","66","=","71',","'5","-","15","=","63',","'3","-","1","=","2']"]

