n = int(input())

if n == 1:
    print("""*""")
elif n == 2:
    print("""*
**""")
elif n == 3:
    print("""*
**
***""")
elif n == 4:
    print("""*
**
***
****""")
elif n == 5:
    print("""*
**
***
****
*****""")
elif n == 6:
    print("""*
**
***
****
*****
******""")
elif n == 7:
    print("""*
**
***
****
*****
******
*******""")
elif n == 8:
    print("""*
**
***
****
*****
******
*******
********""")
elif n == 9:
    print("""*
**
***
****
*****
******
*******
********
*********""")
elif n == 10:
    print("""*
**
***
****
*****
******
*******
********
*********
**********""")


#더 효율적인 방법이 있을텐데 일단 빠르게 정답

#print('\n'.join('*' * (i + 1) for i in range(int(input()))))

# n = int(input())
# for i in range(1,n+1):
#     print('*'*i)
